## mesazon-shared
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Changes Detected 🚨 `true`

<details><summary>Show Plan</summary>

```

terraform
module.mesazon-registry.digitalocean_container_registry.main: Refreshing state... [id=mesazon-fra1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.mesazon-registry.digitalocean_container_registry.main has been deleted
  - resource "digitalocean_container_registry" "main" {
      - endpoint               = "registry.digitalocean.com/mesazon-fra1" -> null
        id                     = "mesazon-fra1"
        name                   = "mesazon-fra1"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mesazon-registry.digitalocean_container_registry.main will be created
  + resource "digitalocean_container_registry" "main" {
      + created_at             = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + name                   = "mesazon-fra1"
      + region                 = "fra1"
      + server_url             = (known after apply)
      + storage_usage_bytes    = (known after apply)
      + subscription_tier_slug = "basic"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>